{
  "date": "2025-02-01T00:00:00.000Z",
  "description": "This month: Flooding! Thunder! Lightning! Potholes! 200 C£ub Results! Facebook Madness! Yeofest! And much, much more...",
  "editorial": "Yeoford Yacht Club Anyone? It really is quite wet out there...and has been for quite a while. January was all about the storms, flooding, mud getting churned off the verges, blocked drains, leaves (why...it ’ s not autumn), power cuts, thunder and lightning and, of course, The Traitors Series 3. But meanwhile, on the Yeoford Hub Facebook page there was a heated and, let ’ s put this politely, slightly bizarre, debate about a potential mural on the rusty railway bridge. After the idea was mooted by a villager, one of our District Councillors managed to secure a small amount of funding. The project would have been run by the community with input from the school. Although there was general support for the idea and offers to provide help and paint, a few individuals vociferously objected, and it now looks like the money will be spent in another village. The district and county council websites have info on how their money can be spent. Tiny amounts of money are available for community projects, whereas infrastructure matters such as potholes, bins, street lighting, etc., come from different budgets. It will be interesting to see if the rusty wall remains or if the councillor continues to explore the potential for cleaning it up. It also flags the need to discuss things openly rather than using isolated social media posts. Hey ho. Anyway, what ’ s happening (apart from keeping an eye on those drains)? Well, not a lot in February, but organisation is well away for the next Yeofest which will be on Saturday 15th March. More details on that next month, but we understand it ’ ll be the usual beer, food, games and music extravaganza that many, many out - of - villagers have taken to their hearts. And that is that. As ever, please send your contributions to the email below if you fancy getting on the front cover, providing some content or entering the joke of the month competition … it can ’ t always be the same three or two people...or one for that matter... Cheers … The Editor",
  "issueNumber": 406,
  "path": "/pdf/newsletter-2025-1-406.pdf",
  "slug": "newsletter-2025-1-406"
}