{
  "date": "2025-01-01T00:00:00.000Z",
  "description": "This month: Garden Bins! Storm Bert! Reminiscence Project! Recycling! Church Library! Black Bins! Storm Darragh! And much, much more...",
  "editorial": "Do Days Have Names Anymore? Ah, as I write this, it ’ s that very unique time of year when you have no idea what day of the week it is, everything is a bit of a fugg and anxiety is at its absolute peak as you have no idea when the bins go out and if it ’ ll be the recycling, black bins or just the garden stuff (which is empty because no - one does gardening at this time of year as it ’ s been tipping down, unless it ’ s stuffed with leaves and branches because of the storm mayhem). Surely it ’ ll be the recycling and black bins, that would make absolute sense rather than have it all knocking around for another week (plus a few days added on for bank holidays), please, not just the garden bins... Anyway, I hope you all had a wonderful Christmas and, bar the recycling worries, are now weighing up what to do with the horrible Orange Creams, Eclairs and Strawberry gunky ones left over from the various boxes of Roses, Celebrations or whatever that have been knocking about. But back to December, and blimey, just when you thought November ’ s Bert had blown everything and everyone about, along came Darragh and that was even worse! Luckily the village has some good links to local roofers, so thanks from us for that. Meanwhile, all the bins migrated to the bottom of the garden...if I only I knew which ones were needed now... What else? The lights competition had a Yeo View 1 - 2, so well done to them! As ever, please send your contributions to the email below if you fancy getting on the front cover, providing some content or entering the joke of the month competition … Oh and it ’ s the garden bins that are going out on the 2nd, the recycling and black bins are on the 8th, noooooooo! Happy New Year! Cheers … The Editor",
  "issueNumber": 405,
  "path": "/pdf/newsletter-2025-0-405.pdf",
  "slug": "newsletter-2025-0-405"
}